SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 33035

 Type ( Engine )
 WagonShape ( 33035.s )
	
 Size  ( 2.67m 4.11m 9.46m )
 CentreOfGravity ( 0.0m 0.0m 0.0m )
 Centre ( -0.00039656m 2.05371m 3.06355m )
 Mass ( 51.25t )
 InertiaTensor ( Box( 2.67m 4.11m 9.26m ) )

 Coupling (
  Type ( Bar )
  Spring (
   Stiffness ( 1e7N/m 1e7N/m )
   Damping ( 0.2e7N/m/s 0.2e7N/m/s )
   Break ( 7e9N 7e9N )
   r0 ( 10cm 1e9 )
    )
  CouplingHasRigidConnection ( 1 )
  Velocity (0.1m/s)
      )

 Coupling (
  Type ( Chain )
  Spring (
   Stiffness ( 1e6N/m 2e6N/m )
   Damping ( 1e6N/m/s 1e6N/m/s )
   Break ( 7e9N 7e9N )
   r0 ( 20cm 40cm )
  )
 )
 

      Buffers (
      Spring (
      Stiffness ( 1e7N/m 0 )
      Damping ( 1e6N/m/s 0 )
      r0 ( 0m 1e9 )
           )
    Centre ( 0.5 ) 
    Radius ( 1 )
    Angle ( 0.5deg )
           )



 Adheasion ( 0.5 0.3 2 0 )
 DerailRailHeight ( 10cm )
 DerailRailForce ( 240kN )
 DerailBufferForce ( 400kN )
 WheelRadius ( 0.485m )
 NumWheels ( 1 )

 Friction (
  7132.4N/m/s    0    5.2mph    8.404N/m/s    1.921
  5.1N/rad/s  1  -1rad/s  0  1
 )

 BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce( 83000N )
 MaxHandbrakeForce( 83000N )
 NumberOfHandbrakeLeverSteps( 0 )
 MaxReleaseRate( 1.5 )
 MaxApplicationRate( 12.5 )
 MaxAuxilaryChargingRate( 15 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )

        
	Lights	(	12
		Light	(
			comment( Flickering Firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( -0 1.98 -3.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.6 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( -0 1.98 -3.5 )
					Azimuth ( -120 -120 -120 )
					Transition ( 0 )
					Radius ( 1.6 )
									
								)
						)
			)
			Light	(	
			comment( Gauge glass Lamp )
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffe610 )
					Position ( 0.17 3.2 -3.50 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				)
			)
			Light ( 
   comment( Chimney Sparks RS1AA ) 
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   TimeOfDay ( 0 )
   Weather ( 0 )
   Coupling ( 0 )  
   )
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 29 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.54 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   )
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.1 3.54 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.50 ) 
   )
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.54 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.42 3.54 )

   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.72 3.54 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.30 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.52 3.54 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.72 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.92 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.30 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.32 3.4 )
  
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.52 3.54 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.92 3.54 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.26 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.35 3.54 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.55 3.54 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.5 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.30 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.48 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.4 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.54 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.54 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.5 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.125 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.54)
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.13 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.54 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.54 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.549 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.133 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.549 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.13 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.549 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.13 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 9.22 3.549 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.130 ) 
                  )
            )
      )


					
			Light	(
			comment( Sphere of light for Exhaust )
				Type		( 1 )
				Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
			)
				Cycle		( 0 )
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				States	(	1
				        State	(
						Duration ( 0.0 )
						LightColour ( 80ffe610 )
						Position ( 0 10.0 -13.75 )
						Transition ( 0 )
						Radius ( 6.0 )
						Angle ( 90.0 )
                                                )
                                 )
		       )
			Light	(
			comment( Inside Cab Glare )
				Type		( 0 )
				Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	2
				State	(
				Duration ( 0.05 )
				LightColour ( 80ffe610 )
				Position ( 0 3.01 -5.045 )
				Azimuth ( 0.0 -5.0 5.0 )
				Transition ( 0 )
				Radius ( 3.0 )
				Elevation ( -25 -25 -25 )
				)
				State	(
				Duration ( 0.05 )
				LightColour ( 80ffe610 )
				Position ( 0 3.01 -5.045 )
				Azimuth ( 0.0 -5.0 5.0 )
				Transition ( 0 )
				Radius ( 3.0 )
				Elevation ( -25 -25 -25 )
					)
				)
			)
			Light	(
			comment( Inside Cab Glare Back )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 3.01 -5.25 )
					Azimuth ( -180 -180 -180  )
					Transition ( 0 )
					Radius ( 2.0 )
					Elevation ( -25 -25 -25 )
				)
			State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 3.01 -5.25 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 2.0 )
					Elevation ( -25 -25 -25 )
				)
				
			)
		)
			
		Light	(
			comment( Flickering Ashpan Front )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 0.63 -1.2 )
					Azimuth ( -90 -90 -90 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 0.63 -1.2 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
									
								)
						)
			)

			Light	(
			comment( Flickering Ashpan Front )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 0.6 -1.2 )
					Azimuth ( 45 45 45 )
					Transition ( 0 )
					Radius ( 1.45 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 0.6 -1.2 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 1.45 )
									
								)
						)
			)

			Light	(
			comment( Flickering Ashpan Front )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 0.6 -1.2 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 0.6 -1.2 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 1.4 )
									
								)
						)
			)

			Light	(
			comment( Flickering Ashpan Front Leading )
				Type		( 0 )
				Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	2
				State	(
				Duration ( 0.05 )
				LightColour ( 80ff7200 )
				Position ( 0 0.64 -1.2 )
				Azimuth ( 0.0 -5.0 5.0 )
				Transition ( 0 )
				Radius ( 1.4 )
				Elevation ( -10 -10 -10 )
					)
				State	(
				Duration ( 0.05 )
				LightColour ( 80ff7200 )
				Position ( 0 0.64 -1.2 )
				Azimuth ( 0.0 -5.0 5.0 )
				Transition ( 0 )
				Radius ( 1.4 )
				Elevation ( -10 -10 -10 )
								)
						)
			)

			Light	(
			comment( Flickering Ashpan Back )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 0.45 -4.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 0.45 -4.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
									
							)
					)
			)
	
			Light ( 
                  comment( Ashpan flashes ) 
			Type ( 0 ) 
			Conditions ( 
			Headlight ( 3 ) 
			Unit ( 0 ) 
			) 
			Cycle ( 0 ) 
			FadeIn ( 0 ) 
			FadeOut ( 0.5 ) 
			States ( 28 
			State ( 
			Duration ( 1 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 01.4 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.4 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 5 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -6.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 5 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 5 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.3 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 5 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 90 90 90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 3 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -180 -180 -180 ) 
			Transition ( 0 ) 
			Radius ( 6 ) 
			) 
			State ( 
			Duration ( 0.1 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 6 ) 
			) 
			State ( 
			Duration ( 5 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.30 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 5 ) 
			) 
			State ( 
			Duration ( 0.5 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( -90 -90 -90 ) 
			Transition ( 0 ) 
			Radius ( 5 ) 
			) 
			State ( 
			Duration ( 0.4 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 00000000 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 4 ) 
			) 
			State ( 
			Duration ( 0.2 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 5 ) 
			) 
			State ( 
			Duration ( 0.6 ) 
			LightColour ( 80ff7200 ) 
			Position ( -0.1 0.14 -3.0 )
			Azimuth ( 0 0 0 ) 
			Transition ( 0 ) 
			Radius ( 5 ) 
                     )
               )
          )


	
)


      Sound ( "..\\..\\common.sound\\2cyl_generic\\2c-80a-eng01.sms" ) 
 )

Engine ( 33035  
 
      Effects (
  SteamSpecialEffects
    (
   CylindersFX
   (
    0.5 0.5725 3.4
    0 -0.4 1.4
    0.1
   )

   CylindersFX
   (
    -0.5 0.5725 3.4
    0 -0.4 1.4
    0.1
   )

   SafetyValvesFX
   (
    0 4.40 -1.75
    0 -0.75 0
    0.350
   )
   SafetyValvesFX
   (
    0 4.20 -1.75
    0 1.3 0
    0.15
   )
   StackFX
   (
    0 4.0 3.6
    0 1 0
    0.3
   )
   WhistleFX
   (
    0 4.26 -2.5
    0 -5.0 0
    0.25
   )
  )
 )



 Wagon ( 33035 )
 IsTenderRequired( 1 ) 
 Type ( Steam )
 MaxPower ( 1520hp )
 MaxForce ( 30081lbf )
 MaxVelocity ( 55mph )
 WheelRadius ( 30.5in )
 Sanding ( 1e9mph )
 NumWheels ( 6 )
 BoilerLength ( 5.7m )
 BoilerRadius ( 0.8m )
 BoilerVolume ( "114596*(in^3)" )
 BoilerEffectivity ( 1.2 )
 BoilerResponsiveness ( 1 )
 CoalBurnage ( 7.0lb/hp/h )
 MaxBoilerOutput ( 24000lb/h )
 ExhaustLimit ( 25050lb/h )
 MaxBoilerPressure ( 230psi )
 SuperHeater ( 1.18 )
 SafetyValvesSteamUsage ( 7623lb/h )
 SafetyValvePressureDifference ( 5 ) 

 PrimingFactor ( 1 ) 
 SteamMinPrimingLevel ( 1 ) 
 SteamPrimingReductionWithCylinderCocksOpen ( 0.5 ) 
 SteamPrimingPowerLossProportion ( 0.9 ) 
 SteamPrimingWaterUsageIncreaseProportion ( 5 ) 

 NumCylinders ( 2 )
 CylinderStroke ( 26in )
 CylinderDiameter ( 19.0in )
 CylinderVolume ( "8.53*(ft^3)" )
 CylinderEffectivity ( 4 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

 MaxFireMass ( 1782lb )
 IdealFireMass ( 1765lb )
 MaxWaterMass ( 1997lb )  
 ShovelCoalMass ( 10lb )
 SmokeCombustion ( 20 )
 BasicSteamUsage ( 20lb/h )
 BasicCoalUsage ( 110lb/h )
 MaxTenderCoalMass ( 11200lb )
 MaxTenderWaterMass ( 37000lb )

 InjectorTypes( 0 1 ) 
 InjectorSizes ( 11mm 11mm )
 Injector1FeedrateMultiplierExhaust ( 1.15 )
 Injector1FeedrateMultiplierLive ( 0.6 ) 
 Injector2FeedrateMultiplierExhaust ( 1.15 )
 Injector2FeedrateMultiplierLive ( 0.6 ) 
 Injector1WaterValveVariance ( 0.25 )
 Injector2WaterValveVariance ( 0.25 )
 InjectorLimits1 ( 50psi 0.6 1 )
 InjectorLimits2 ( 60psi 0.6 1 )
 
 SteamMaxSmokeUnitsReleaseRate( 1 )
 MaxSteamHeatingPressure( 0 )
 SteamSmokeUnitsPerPoundOfFuel( 1 )
 
 CutoffMaxReverse ( -0.75 )
 CutoffMaxForward ( 0.75 )
 SteamSmallestCutoff( 0.9 )
 RegulatorValveType ( Twin_port )
 RegulatorSecondValveStartPosition( 0.95 )
 RegulatorPilotValveExponent( 0.5 )
 RegulatorSecondValveExponent( 1.75 )
 RegulatorPilotValveFullOpenning( 0.95 )
 RegulatorMainValveInitialOpenning( 0.94 )

 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.15 )
 BlastExponent ( 0.5 )
 DraftingEffect ( 1.0 )
  
 BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
 BrakesEngineControllers( "Hand, Train" )
 VacuumBrakesSmallEjectorPowerRating( 35 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 310 )
 VacuumBrakesLargeEjectorUsageRate( 410 )
 VacuumBrakesHasVacuumPump( 0 )
 TrainBrakesControllerMaxApplicationRate( 9 )
 TrainBrakesControllerMaxReleaseRate( 0.78 )
 TrainBrakesControllerEmergencyApplicationRate( 15 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )
 
 NumberOfDamperSteps( 5 )
 SteamGaugeGlassHeight( 10 )
 SmokeCombustion ( 20 )

 SteamWaterScoopMinPickupSpeed( 250 ) comment( mph )
 SteamWaterScoopMaxPickupSpeed( 600 ) comment( mph )
 SteamWaterScoopResistance( 0N )
 comment( pounds per second. 0gallons per minute max. )
 SteamWaterScoopMaxPickupRate( 0 )

 
 CabView ( Q1Cab.cvf )
 HeadOut (  -1.4 3.0 -4.0 )

 EngineControllers (
            comment( Engine controls )
        
            Regulator ( 0 1 0.025 0 
                NumNotches( 0 )
            )
 		Cutoff ( -0.75 0.75 0.0075 0 
 		NumNotches( 15
 			Notch ( -0.75 0 Dummy )
 			Notch ( -0.65 0 Dummy )
 			Notch ( -0.55 0 Dummy )
 			Notch ( -0.45 0 Dummy )
 			Notch ( -0.35 0 Dummy )
 			Notch ( -0.25 0 Dummy )
 			Notch ( -0.15 0 Dummy )
 			Notch ( 0.0 0 Dummy )
 			Notch ( 0.15 0 Dummy )
 			Notch ( 0.25 0 Dummy )
 			Notch ( 0.35 0 Dummy )
 			Notch ( 0.45 0 Dummy )
 			Notch ( 0.55 0 Dummy )
 			Notch ( 0.65 0 Dummy )
 			Notch ( 0.75 0 Dummy )
		)

            )
            Brake_Train ( 0 0.99 0.0475 0.65 
            NumNotches( 4
            Notch( 0     0 TrainBrakesControllerReleaseStart )
            Notch( 0.05  0 TrainBrakesControllerRunningStart )
  		Notch( 0.2   0 TrainBrakesControllerSelfLapStart )
            Notch( 0.3   1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0 
                NumNotches( 0 )
            )
            FireDoor ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.0 
                NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.025 20 
                NumNotches( 0 )
            )
            Shovel ( 0 2 0.5 0 
                NumNotches( 0 )
            )
            DampersFront ( 0 1 0.1 0.15 
                NumNotches ( 5 
                  Notch ( 0      0 Dummy )
                    Notch ( 0.25 0 Dummy )
                    Notch ( 0.5  0 Dummy )
                    Notch ( 0.75 0 Dummy )
         		  Notch ( 1    0 Dummy )
       				)
    		)

            DampersFront ( 0 1 0.1 0.15 
                NumNotches ( 5 
                  Notch ( 0      0 Dummy )
                    Notch ( 0.25 0 Dummy )
                    Notch ( 0.5  0 Dummy )
                    Notch ( 0.75 0 Dummy )
         		  Notch ( 1    0 Dummy )
       				)
    		)

            Injector1Steam ( 0 0.75 0 )
            Injector2Steam ( 0 0.75 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

 comment(fire temp, fire mass, water mass, boiler pressure,
  water level, tender_water_mass, tender_coal_mass,
  smoke_quantity, fire_condition, coal quality )
  
 EngineVariables( 900 1700 1536 235 1.0 3700 1.0 10 1.0 0.85 )

 Sound ( "..\\..\\common.sound\\2cyl_generic\\2c-80a-cab01.sms" )

     Name ( "Tonbridge Q1 33035" )
  Description (
      "The Bulleid Q1 Class were introduced during World War II to cope with the increased freight on the Southern Region. They were the most powerful 0-6-0 loco in Britain. Although they were built for the war effort they lasted well into the 1960's mainly allocated to Guildford and Feltham.\n\n"+

	"33035 was allocated to Tonbridge throughout the fifties.\n\n"
	

 )
 EngineOperatingProcedures (
      "Ideal Fire Mass is 936 lb\n"+
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+  
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)
